# LinePattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LinePattern Property
ParameterTypeId Class See Also
---
"Line Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LinePattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinePattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LinePattern {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace